/**
 * @file rtmc.c
 * @brief rtmc(real time measurement component) 公開インターフェース定義
 *
 * @copyright copyright (c) 2023 EkiOka
 *
 */
#define COMPONENT_ID 0x75FEF39E
#include "internal.h"

/* ------------------------------------------- */
/*
    include
*/
/* ------------------------------------------- */

/* C言語 標準型のinclude */

/* 開発基盤 標準型のinclude */

/* C言語標準ライブラリのinclude */

/* OS / 基盤ソフトのinclude */

/* システム共通ライブラリのinclude */

/* 他コンポーネントのinclude */

/* 自コンポーネントのinclude */

/* 自ファイルのinclude */
#include "rtmc.h"

/* ------------------------------------------- */
/*
    define
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    typedef
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    function prototype
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    variable
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    function table
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    static const variable
*/
/* ------------------------------------------- */

/* ------------------------------------------- */
/*
    function
*/
/* ------------------------------------------- */

STATIC void rtmc_initialize(void)
{
}

/* ------------------------------------------- */
/*
    public function table
*/
/* ------------------------------------------- */

const rtmc_if rtmc = {
    &rtmc_initialize, /* event_reset */
    &rtmc_initialize, /* event_restart */
};
